Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.ConnectionMarkPropertyElementTypes Class
 The ConnectionMarkPropertyElementTypes class represents the available property element types for connection marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.ConnectionMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class ConnectionMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class ConnectionMarkPropertyElementTypes
The PropertyElement.PropertyElementType.ConnectionMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Code
Returns the code property element type.
ConnectionError
Returns the connection error property element type.
ConnectionNumber
Returns the connection number property element type.
DSTVCode
Returns the DSTV code property element type.
Group
Returns the group property element type.
Name
Returns the name property element type.
RunningNumber
Returns the running number property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace